app/Models/AdminModel.php

SELECT *
FROM `booking` `b`
JOIN `pelanggan` `p` ON `p`.`id_pelanggan` = `b`.`id_pelanggan`
JOIN `layanan` `l` ON `l`.`id_layanan` = `b`.`id_layanan`
WHERE `b`.`Tanggal_Booking` >= '2023-06-01'
AND `b`.`Tanggal_Booking` <= '2023-07-08'
---
   public function getDataByDateRange($start_date, $end_date)
{
    $builder = $this->db->table('booking b');
    $builder->select('*');
    $builder->join('pelanggan p', 'p.id_pelanggan = b.id_pelanggan');
    $builder->join('layanan l', 'l.id_layanan = b.id_layanan');
    $builder->where('b.Tanggal_Booking >=', $start_date);
    $builder->where('b.Tanggal_Booking <=', $end_date);
    $query = $builder->get();